<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"597cc49c443744770b3a7fabcc1e293272d2fa40cfc0ad4dd8c48650336a7b30","plan_job_ref":"Job Pull Request Checks #4863 at https://github.com/GSA-TTS/FAC/actions/runs/15996737532","plan_out_hash":"b37c2da894b66cecf2403b0623713eb3706b71e9b2c5a7439bf19cd9f3e26619","plan_hash":"f66798a4587b4807076755a20dad37ba522c4b6ef3b913fbc65507d0cc271cf7","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 1 to add, 7 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "74ef79bb-2502-40ea-9138-385669a4397b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              source_app      = "74ef79bb-2502-40ea-9138-385669a4397b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "23cd75fe-c912-44e7-8999-4686eae30d72" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "23cd75fe-c912-44e7-8999-4686eae30d72" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:e7d80b1aef5201a48b8676d250ea72f5b2fb198aaed8e861bef2d045d12da9f9" -> "ghcr.io/gsa-tts/fac/clamav@sha256:3357cf6e7675895586217b7b5b1954a0e8f4e69541d36d5a5b14a6c325bb1311"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-06-24T10:43:04Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-06-28T10:37:36Z" -> (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T14:54:12Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:e7d80b1aef5201a48b8676d250ea72f5b2fb198aaed8e861bef2d045d12da9f9" -> "ghcr.io/gsa-tts/fac/clamav@sha256:3357cf6e7675895586217b7b5b1954a0e8f4e69541d36d5a5b14a6c325bb1311"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging-fs.apps.internal" -> null
            },
        ] -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-06-24T10:42:59Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "74ef79bb-2502-40ea-9138-385669a4397b" -> null
-               app_process_type = "web" -> null
-               id               = "203269d4-78a2-425f-bbac-2f96bd76b378" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "8dec12f0-4f36-4b17-8f5d-f3adfbc29544"
!~      updated_at   = "2025-04-21T19:51:48Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "23cd75fe-c912-44e7-8999-4686eae30d72" -> null
-               app_process_type = "web" -> null
-               id               = "b74722e4-9b39-4eb3-942b-9abadc9aaa56" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "12c1022d-ee9f-4535-afd8-b0bccfbab707"
!~      updated_at   = "2025-06-17T17:14:06Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 1 to add, 7 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4863](https://github.com/GSA-TTS/FAC/actions/runs/15996737532)